### 데이터가 중요한 이유는?

1. 데이터를 가공해 다양한 일을 할 수 있음
2. 인터넷에 연결된 웹과 앱을 통해 소식과 지식을 전파할 수 있음
3. 빅데이터나 인공지능과 같은 기술을 이용해 대규모의 데이터로부터 통찰력있는 분석결과를 뽑아낼 수 있음<br><br>
   이런 일을 하기 위해서는 데이터를 저장하고 꺼낼 수 있어야 함


### 이를 위한 수단은?   **File**

1. 장점
   - 사용이 쉬움
   - 운영체제마다 파일기능 제공해 어디서나 사용가능
   - 이메일, 메신저를 이용해 간편하게 전송도 할 수 있음

2. 단점
   - 성능, 보안, 편의성의 한계를 가지고 있음<br><br>
   이 한계를 극복한 소프트웨어가 데이터베이스


### 데이터베이스 제품
MySQL, Oracle, SQL Server, PostgreSQL, MongoDB 등등


### 상상력

데이터베이스는 거대하고 복잡하고 위험한 데이터를 다루기 위해 고안된 도구<br>

이런 데이터를 이미 가지고 있는 사람에게 데이터베이스의 복잡성은 자신이 해결한 문제에 비하면 아무것도 아닐 것임<br>

하지만, 데이터베이스를 처음 접하는 사람은 이런 문제에 직면할 기회가 없었을 것이므로 데이터베이스가 어렵고 뜬구름 잡는것처럼 느껴질 것<br>

따라서 상상력을 발휘해 수업에서 사용할 예제를 크고 복잡하고 위험하게 간주해야 함<br>

그래야 **데이터베이스의 복잡성**에 대해 **공감**할 수 있을 것
